{"title": "French Catholic Roots, Former Cop, Professional Therapist, Came to the Corner, Went to Church", "date": "2024-02-10", "summary": "This interview covers a lot of territory, touching on various aspects of mental health, therapy, the difficult nature of contemporary teenage male behavior and the way that mental health and problems manifest in different ways depending on factors such as wealth and family background. We also see significant parallels between the therapeutic and religious realms, both involving personal growth, moral direction, spirituality, tradition and emotional engagement. These shared qualities are likely a major reason Jordan Peterson's religious outlook is attractive to many who first engaged with him as a therapist.\n\nTowards the end of the interview, there is a discussion about parenting and how it's difficult to create an effective, learning situation when children resort to problematic distractions like video games, pornography or self-medicating with alcohol and marijuana.\n\nAaron Beck makes a number of important comments highlighting the trials, tribulations and challenges dealing with these ever-changing issues within a relationship context. Parents and her Therapists must create a balance that is systemic in nature and not solely individualistic in nature. The conversation addresses the tendency for people— even Christians— to insulate themselves within their own cultural and religious confines, emanating from a lack of greater understanding or knowledge of other religious perspectives. Aaron goes on to explain how the Catholic approach tends to be more inclusive of a broader range of rituals and traditions, especially regarding death, thereby creating a more fertile environment for unique development beyond what is often perceived as a purely Christian path.\n\nTo conclude, the interview serves as a microcosm of the myriad of concerns and ideological wrestling matches present in the contemporary world— one in which mental health, tradition, transition, ritual, religion and drugs all play a significant part. The conversations highlight the complexity of human behavior and relationships, and the importance of creating an environment in which genuine and rigorous growth can occur. But in the process, there seems to be a prevailing sentiment that the rising tide of tribalism is making the uphill climb towards genuine transcendence all that much more challenging."}