{"title": "Food Truck Emily: How the Gospel of My Right Arm Has Failed Me", "date": "2024-02-09", "summary": "Wow. Just wow. Much as been said here but one little thing that stood out for me and I think ties it all together, is how multiple people had talked about ultimate, innocent love, and the idea of Jesus' love and the kingdom of God. But especially where they mentioned how can we bring that to bear in our day-to-day.\n\nThe world so complex. All these power plays and fights going on. The reconciliation work that Jesus did was seen as a rebellion. A very dangerous one at that. But he do it precisely because he loved the unlovable. That's how we can find our role in God's Kingdom. The \"stage\" or the battleground may be set in a freighted way, but we can fill it with love. The power to love others even when it may not seem to make sense. In the little ways that we can bring unconditional love to the people in front of us. Not lording love over people's heads, but being able to first love them where they are. To love our neighbours, like real people, all of them. It's hard, it's challenging, it may be uncomfortable and sometimes we may really fail. But we can try. Fight with love instead of words.\n\nThis isn't the Kingdom of God in its fullness and full glory. It's messy. Its the unpolished rough draughts of the Kingdom. The stained glass in the cathedrals is gorgeous, but they're not made in the cathedrals, they're made painstakingly and lovingly by an unseen creator working for years on a seemingly small glass pane that when set within the cathedral's architecture, is suddenly vital to tell the whole gospel story. And so is each of us in all of our failures, in all of our awkward and uneven trying. In trying to find the right words, to make the right choices, to start apologising and making amends. To listen to your own heart and share it with others, to support them, and to lead a life that strives to be grace that extends even to the unlikeliest and most irritating of us.\n\nBy sharing our own broken stories of struggle, anger, shame and inadequacy, we can more empathically bear the pain and heartache of those around us, of the tiny cathedral glass pieces of their lives. We become an essential part of changing the narrative, as much as it's a spiritual and daily discipline.\n\nAs Jimmy Detloya said: \"I don't fight for religious freedom, I fight for religious love.\" We can do this one day at a time. That's why Chastain writes of St Francis' order that (paraphrasing) his order seemed unfocused, it wandered everywhere with seemingly no destination, but perhaps the real power of their love would more convincingly reveal the kingdom.\n\nAnd so like Chogyam Trungpa's quote notes, we should practice meditation without any goal, over and over again. It's through the ongoing process and not the destination itself of becoming more loving and kind people that this Kingdom of Love increases in the world.\n\nIn a rock n roll sense, Jacob White from Essential Fire discussed the inherent and underlying theme in Leonard Cohen's Hallelujah in the struggles he experienced in his relationships, love and his life even as a songwriter. As a person he was terrible in human relations, he had no time for people, yet the songs he wrote contain moments of tenderness that touches that deep, primal part of our human-ness. That deep yearning to love and be loved.\n\nCohen himself didn't find contentment, he regrets the treatment of women, but he kept trying - always learning from the rocky ground of his life and somehow, what came out through his music was an understanding and intimacy with the human condition, the messiness of it all.\n\nSo we are to take heart. As the centre part of the cross is where Jesus' heart was pierced, it's where the beginning of love unfurls, and we are to keep a watch out for these glimpses and reminders that light up even the seemingly unlikely. To keep trying. To forgive as much as we can. To keep praying. To know and love all people, to believe the best of humanity. To look for the places where we can be kind.\n\nIt might not always be easy, there'll be hard days. In a world filled with its share of evil and brokenness, and we must remember that God's love and the power of the Work is always at work. That we may not see Him and that's ok. We may see Him there, in the little reflections of the spirit in people. In this imperfect world. Amidst attempts at perfection. In the messy, multi-dimensional lives we live.\n\nThat's how it all begins - in the smallest things, in the big world. With all sorts of hearts, with all kinds of people. And when it falls silent, we begin again. Each effort, in our little draught of a life, brings us closer to His presence, the love that passes human understanding. And it's to be lived not in repeated lamentations of past failure or fleeting victories, but loving the people all around us as they really are. For the kingdom of love have come, and is with us, bringing light into all the dark and unlit spots of our existence. Amen."}