{"title": "Islam, meet Mr. Enlightenment. Moderns, Meet Mr. Francis, the Lover. Awash in Historiography", "date": "2024-02-07", "summary": "\"The Screen of St. Francis\" (Chesteron) bridges the intellectual and imaginative gap between the contemporary reader and the medieval saint, Francis of Assisi. This gap exists primarily because Francis's world-view and thus his actions cannot be easily understood today. A reader might assume that the saint lived an overtly ascetic life, adhering to the most rigid ideals of morality while being minimally, if at all, comfortable within the world he inhabited. However, Chesteron ardently points out in the article, this is not the case at all. The saint was indeed passionate in his pursuit of divine love. However, the naivety lies in the reader's (or, as the case may be, the modern man's) misconception of Francis's 'saintliness' as cold rational moral rectitude. Essentially, what Chesteron is saying is 'Francis's saintliness stemmed from a kind of fiery passion, a love, for both God and his fellow brethren.' Unlike mere asceticism which intrinsically implies a separation from the world and people around, the saint's life was filled with joy, love, the remarkable artistic and poetic inclination reflecting an engaging willingness to dive full on into life's peculiarities and idioms. The saint never viewed this world as dreary and\nthe devout as hypocritical; instead, he poured all his ardor into making a fruitful communion with both, God and his fellow men and beasts. In essence, his 'saintliness' stemmed not from adhering to universal, supposedly unchanging, and rigid rules of morality, but from his deep, almost fervent, passionate love for God, his fellow men and even nature's more innocent erotic wonders. This passionate love isn't embodied in high moral principles alone, rather it is a wild yet potent and sometimes what some may deem unreasonable mix of conventions, whims, praises, kisses, nudity, comforts and even simplicities. In layman's words, Francis was a genuine Troubadour, a devout romantic, a lover; a lover with a stringent adage - \"God foresakes not His nudities.\"\n\nWhat we can imply from this, thus is, the medieval saint's life cannot be categorized in the traditional schema of sainthood. Francis's 'saintliness' isn't just a complex weaving of paradoxes and inconsistencies, but it's the wonderful rhythm and melody of faith, emotionality and practicality that his life presently conducted. Francis's asceticism wasn't well, dialectical asceticism, it transcended the abstract confines of the markers of ascetism to embody a all encompassing ardor, a profound ardor of love for what you might consider an impossible totality. It might not be the conventional totality comprising of piety, rationalism, and pure morality as it also gathers into its encompassing arc the unconventional totality of the emotional, the a-rational, and the irrational; these however are no less valid sections of a whole. The 'saintliness' that characterized Francis's life could ineluctably be seen as unfathomable and mystifying by the contemporary 'rational mind'. Hence, for Chesteron, a clear and penetrative 'approach' to the saint is essentially his understanding of the 'agnificent Romance' of Francis's life - his love, his ardor, his passion - all in all, his 'man love'. His view also deal astutely with the conundrum of the 'consistency to inconstancy' intrinsic in the human habitat - a contradictory interface of rationality and irrationality, simplicity and complicity, emotion and qualms, all mesh together in a confused, chaotic and ribald confluence, that is life, an exuberant fiesta of artistic and human experiences, a celebration of creativity and 'turbid' emotions, all molded in a grand narrative of emphatic love.\n\nIn summary, Chesteron's view is clear cut - Francis's 'saintliness' cannot be correctly grasped or understood when it's reduced to the conventional duality of 'saint' and 'general morality'. Conveniently, Chesteron terms it rightly as 'saint-romance'. His unique comprehension of Francis literature presents a 'stirring narrative' that meddles with a potpourri of absurdities, dissonances and profound incongruencies yet unveils the mysterious yet exuberant paradox of a life that is both 'impossible' and 'actually lived'. It's the art of 'living fiercely' and fiercely 'living' that moreover embodies Francis's essence - 'saintliness' is hence fundamentally an intense 'love affair' with God and the world. It encompasses an all-consuming exuberant frenzy that embraces all the radiances and coruscations of life as they unfold. Each one of these peculiar paradigms embodies, not the arbitrary ensemble of rules and laws, but an elaborately choreographed dance of joy, a passionate championship, a wild exuberance. So fundamentally, Chesteron's view could be summed up as this- the essence of saintliness quintessentially embodies love; not a narrow, pedantic, timid and conventional love, but a deep passionate, indeed fiery, love; a love which brings together the contradictory aspects of the medieval world in melodiou s cosmic harmony; a love that encompasses everything from the quest for a quiet hearth and the shadows to the wild institutions, the complexity, the inextricable incongruities of life. The saint's life thus is profoundly emotional, embodies the 'interplay of opposites and the pathetic paradoxical intricacies' of the medieval world. In essence, the task for the modern man is to appropriate 'saintliness' as a part of romantic medieval narrative, a journey which reflects love’s ardor and traverses the dualities of stereotypical 'morality' and 'lavish revelries', and incorporates them all together harmoniously. It's in reclaiming saintliness' as part of this love narrative that stirs the soul, not as an undigested, uncongenial or hypertrophic growth, but unearths the heart's deepest longings and true desires. In this Chesterton once said, 'we must re-unite the neglected parts to make what is whole, a beautiful thing'. In a way, 'The Screen of St. Francis' harks us back to an age where saints were not just proficient at elucidating God's love and His will, but also fathoming the unvarnished complexities of human love. For, they were tirelessly embodying the union of the sacred and the profane - the fusion of both ennoblingly and liberatingly - the only balance that true love can make possible. That potential is still open and resounding yet unfulfilled, and this task of reconciling love's twin poles, its heavenly and earthly components, remains uncompleted and beyond Francis's expectations. The unfolding of life with its brilliant but profound, contradictory dynamics takes the world to a state which modern man can only fleetingly experience – a state which is not seen; a state which is not lovingly inclusive, with its contradictions enchanted into symphony, its mountains and valleys, its love and 'supreme absurdities' woven together in a beautiful tapestry, baffling the mind but enriching the heart.Therein rest the helm of Francis's unique sainthood, a sainthood that embodies the profoundly ambivalent moral ecology of medieval world, that's deeply rooted in the human and the divine love, that reflects it's own multifarious contradictions and embraces every 'possible impossibility' of life as a part of its holistic narrative, that ardently and passionately encompasses its glittering paradoxes, and that addresses its complexities and turbidities not in polemic, nor in a cold cerebral analysis, but in the living ardor of a grand romance. Ironically it's precisely this possible impossibility, this ardency of loving that very closely links the saint's actions to the 'ordinary man'. It's in these paradoxes, in these connections, in this contradictions, this grand 'romance', Chesteron argues, that lies the beauty of true love, the beauty of ordinary men, the beauty of this saint, the passion of faith, the romance of life."}